var mockFavorites = [{ name: "Суп Грибной со звездочками (вегетарианский)"},
{ name: "Борщ \"Украинский\" с мясом"},
{ name: "Суп Сливочный с Семгой"},
{ name: "Каша молочная пшённая с тыквой"},
{ name: "Грудка куриная отварная (диетическая)"},
{ name: "Сосиски молочные \"Микояновские\" отварные"},
{ name: "Сосиски молочные \"Микояновские\" отварные + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Сосиски молочные \"Микояновские\" отварные + МАКАРОНЫ"},
{ name: "Грудка куриная фаршированная сыром и ветчиной"},
{ name: "Грудка куриная фаршированная сыром и ветчиной + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "МАКАРОНЫ"},
{ name: "Люля-Кебаб из Говядины с томатным соусом"},
{ name: "Люля-Кебаб из Говядины с томатным соусом + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Люля-Кебаб из Говядины с томатным соусом + МАКАРОНЫ"},
{ name: "Поджарка из Филе тилапии жареная в муке"},
{ name: "Поджарка из Филе тилапии жареная в муке + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Поджарка из Филе тилапии жареная в муке + МАКАРОНЫ"},
{ name: "КАРТОФЕЛЬНОЕ ПЮРЕ"},
{ name: "РИС С ШАФРАНОМ"},
{ name: "МАКАРОНЫ"},
{ name: "КАПУСТА ТУШЕНАЯ С ЛУКОМ И МОРКОВЬЮ"},
{ name: "Запеканка творожная ванильная с ежевичным соусом"},
{ name: "Суп Грибной со звездочками (вегетарианский)"},
{ name: "Борщ \"Украинский\" с мясом"},
{ name: "Суп Сливочный с Семгой"},
{ name: "Каша молочная пшённая с тыквой"},
{ name: "Грудка куриная отварная (диетическая)"},
{ name: "Сосиски молочные \"Микояновские\" отварные"},
{ name: "Сосиски молочные \"Микояновские\" отварные + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Сосиски молочные \"Микояновские\" отварные + МАКАРОНЫ"},
{ name: "Грудка куриная фаршированная сыром и ветчиной"},
{ name: "Грудка куриная фаршированная сыром и ветчиной + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "МАКАРОНЫ"},
{ name: "Люля-Кебаб из Говядины с томатным соусом"},
{ name: "Люля-Кебаб из Говядины с томатным соусом + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Люля-Кебаб из Говядины с томатным соусом + МАКАРОНЫ"},
{ name: "Поджарка из Филе тилапии жареная в муке"},
{ name: "Поджарка из Филе тилапии жареная в муке + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Поджарка из Филе тилапии жареная в муке + МАКАРОНЫ"},
{ name: "КАРТОФЕЛЬНОЕ ПЮРЕ"},
{ name: "РИС С ШАФРАНОМ"},
{ name: "МАКАРОНЫ"},
{ name: "КАПУСТА ТУШЕНАЯ С ЛУКОМ И МОРКОВЬЮ"},
{ name: "Запеканка творожная ванильная с ежевичным соусом"},
{ name: "Суп Грибной со звездочками (вегетарианский)"},
{ name: "Борщ \"Украинский\" с мясом"},
{ name: "Суп Сливочный с Семгой"},
{ name: "Каша молочная пшённая с тыквой"},
{ name: "Грудка куриная отварная (диетическая)"},
{ name: "Сосиски молочные \"Микояновские\" отварные"},
{ name: "Сосиски молочные \"Микояновские\" отварные + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Сосиски молочные \"Микояновские\" отварные + МАКАРОНЫ"},
{ name: "Грудка куриная фаршированная сыром и ветчиной"},
{ name: "Грудка куриная фаршированная сыром и ветчиной + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "МАКАРОНЫ"},
{ name: "Люля-Кебаб из Говядины с томатным соусом"},
{ name: "Люля-Кебаб из Говядины с томатным соусом + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Люля-Кебаб из Говядины с томатным соусом + МАКАРОНЫ"},
{ name: "Поджарка из Филе тилапии жареная в муке"},
{ name: "Поджарка из Филе тилапии жареная в муке + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Поджарка из Филе тилапии жареная в муке + МАКАРОНЫ"},
{ name: "КАРТОФЕЛЬНОЕ ПЮРЕ"},
{ name: "РИС С ШАФРАНОМ"},
{ name: "МАКАРОНЫ"},
{ name: "Поджарка из Филе тилапии жареная в муке + МАКАРОНЫ"},
{ name: "КАРТОФЕЛЬНОЕ ПЮРЕ"},
{ name: "РИС С ШАФРАНОМ"},
{ name: "МАКАРОНЫ"},
{ name: "КАПУСТА ТУШЕНАЯ С ЛУКОМ И МОРКОВЬЮ"},
{ name: "Запеканка творожная ванильная с ежевичным соусом"},
{ name: "Суп Грибной со звездочками (вегетарианский)"},
{ name: "Борщ \"Украинский\" с мясом"},
{ name: "Суп Сливочный с Семгой"},
{ name: "Каша молочная пшённая с тыквой"},
{ name: "Грудка куриная отварная (диетическая)"},
{ name: "Сосиски молочные \"Микояновские\" отварные"},
{ name: "Сосиски молочные \"Микояновские\" отварные + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Сосиски молочные \"Микояновские\" отварные + МАКАРОНЫ"},
{ name: "Грудка куриная фаршированная сыром и ветчиной"},
{ name: "Грудка куриная фаршированная сыром и ветчиной + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "МАКАРОНЫ"},
{ name: "Люля-Кебаб из Говядины с томатным соусом"},
{ name: "Люля-Кебаб из Говядины с томатным соусом + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Люля-Кебаб из Говядины с томатным соусом + МАКАРОНЫ"},
{ name: "Поджарка из Филе тилапии жареная в муке"},
{ name: "Поджарка из Филе тилапии жареная в муке + ПЮРЕ"},
{ name: "ШАФРАНОМ"},
{ name: "Поджарка из Филе тилапии жареная в муке + МАКАРОНЫ"},
{ name: "КАРТОФЕЛЬНОЕ ПЮРЕ"},
{ name: "РИС С ШАФРАНОМ"},
{ name: "МАКАРОНЫ"},
{ name: "КАПУСТА ТУШЕНАЯ С ЛУКОМ И МОРКОВЬЮ"},
{ name: "Запеканка творожная ванильная с ежевичным соусом"}]


function random(n){
    return Math.round( Math.random() * n );
}


mockFavorites = (function(){

    var groups = ['первые блюда', 'вторые блюда', 'холодные блюда и закуски', 'бутерброды, выпечка', 'прочее'];
    var providers = ['Фьюжн', 'Хлеб-Соль'];
    var res = mockFavorites.map(function(dish){
        return {
            name: dish.name,
            favorite: false,
            id: random(10000),
            group: groups[ random( groups.length - 1 ) ],
            provider: providers[ random( providers.length - 1 ) ]
        };
    });

    for ( var i = 0; i < 15; i++ ) {
        var dish = res[ random( res.length - 1 ) ];

        console.log('SET FAVOURITE', dish);

        dish.favorite = true;
    }

    return res;

}());
